app/controllers/logs_controller.rb

SELECT "logs".* FROM "logs" ORDER BY created_at DESC
---
  def index
    @logs = Log.order('created_at DESC').all

SELECT "logs".* FROM "logs" WHERE "logs"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @log = Log.find(params[:id])

SELECT "logs".* FROM "logs" WHERE "logs"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @log = Log.find(params[:id])

INSERT INTO "logs" ("created_at", "day", "description", "duration", "end", "name", "start", "ticket", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @log = Log.new(params[:log])

    respond_to do |format|
      if @log.save

SELECT "logs".* FROM "logs" WHERE "logs"."id" = ? LIMIT 1  [["id", "32"]]
UPDATE "logs" SET "duration" = 0, "updated_at" = '2013-03-15 08:26:06.042548' WHERE "logs"."id" = 37
---
  def update
    @log = Log.find(params[:id])

    respond_to do |format|
      if @log.update_attributes(params[:log])

SELECT "logs".* FROM "logs" WHERE "logs"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "logs" WHERE "logs"."id" = ?  [["id", 2]]
---
  def destroy
    @log = Log.find(params[:id])
    @log.destroy