app/views/logs/edit.html.erb

SELECT "logs".* FROM "logs" WHERE "logs"."id" = ? LIMIT 1  [["id", "30"]]
---
<script>
$(document).ready(function(){

  var query = window.location.search.substring(1);
  var s = query.split("&");
  console.log(query);

  var s2 = new Array();
  for(i=0;i<s.length;i++){
  	var sc = s[i];
  	s2.push(sc.split("="));

  }
  console.log(s2);
 	var dt = new Date();
 	var month = dt.getMonth();
	var oDay = dt.getFullYear() + "/" + (month+=1) + "/" + dt.getDate();
	var oStart = dt.getTime();
	var oEnd = s2[0][1];

  	document.getElementById('log_day').value = oDay;
  	document.getElementById('log_end').value = oEnd;