app/views/logs/index.html.erb

<script>
$(document).ready(function(){
    var now = new Date();
    var timeVar = now.getHours() + ':' + now.getMinutes();
    document.getElementById('currentTime').innerHTML = timeVar;
    var durTime = 0;
//https://centralway.atlassian.net/browse/CWA-323
    var ddd = $('a').first().attr('href');
    /*if(window.location.href.lastIndexOf("/logs/46")){
        console.log("awesome");
    }*/
    /*
    var total = $('a').length;
    $('a').each(function(index) {
        if (index === total - 1) {
            console.log(this);
        }
    });
    */
    /*
    var total2 = $('.showEnd').length;
    $('.showEnd').each(function() {
---
SELECT "logs".* FROM "logs" ORDER BY created_at DESC